load-test-2000.yml
config:
  target: "https://transpadilla-web.onrender.com"
  phases:
    - duration: 120
      arrivalRate: 5
      rampTo: 30
      name: "Escalado a ~2100 usuarios"
  defaults:
    headers:
      Accept: "application/json"
  http:
    pool: 20

scenarios:
  - name: "Pasajero - mapa y rutas"
    flow:
      - get:
          url: "/api/healthz"
      - get:
          url: "/api/buses"
      - get:
          url: "/api/rutas"
      - get:
          url: "/api/rutas/paradas/todas"
      - get:
          url: "/api/stats"
      - get:
          url: "/api/push/clave-publica"

  - name: "Pasajero - consulta ETA"
    flow:
      - get:
          url: "/api/rutas"
          capture:
            - json: "$[0].id"
              as: "rutaId"
      - get:
          url: "/api/rutas/{{ rutaId }}/eta"
      - get:
          url: "/api/rutas/{{ rutaId }}/paradas"
      - get:
          url: "/api/buses"