load-test.yml
config:
  target: "http://localhost:8080"
  phases:
    - arrivalCount: 5000
      duration: 1
      maxVusers: 50
      name: "5000 requests (50 concurrencia)"

scenarios:
  - name: "GET /healthz"
    flow:
      - get:
          url: "/healthz"
  - name: "GET /buses"
    flow:
      - get:
          url: "/buses"
  - name: "GET /rutas"
    flow:
      - get:
          url: "/rutas"